org/concepts/filesystems.org
#+setupfile:./hugo_setup.org
#+hugo_slug: file-systems
#+TITLE: File Systems

File systems are pretty cool, they manage how you interact with your files.

You can create new ones without modifying your kernel by using FUSE.

I use ext4 at the moment, but a future install of my operating system will make use of btrfs or the other advanced one so that I have access to rollbacks!

* Projects
https://github.com/ipfs/awesome-ipfs interplanetary file system configuration
https://github.com/edolstra/dwarffs allows debug tools to automatically look up debug information over the internet
